# 레이블과 커스텀 태그파일

label2mood_6 = {
# Jinuuuu model labels
    # 0: "분노", 1: "불안", 2: "당황", 3: "기쁨", 4: "슬픔", 5: "상처"
# Custom labels for Team Haeil ver.1
    # 0: "분노/짜증", 1: "불안/걱정", 2: "중립/기타", 3: "기쁨/행복", 4: "슬픔/우울", 5: "슬픔/우울"
# yShelby model labels
    0: "기쁨/행복", 1: "평온/만족", 2: "슬픔/우울", 3: "분노/짜증", 4: "불안/걱정", 5: "지루/권태"
}

mood_to_tags_map = {
    "분노": ["#분노", "#화남", "#분개"],
    "슬픔": ["#슬픔", "#우울", "#비탄"],
    "불안": ["#불안", "#초조", "#걱정"],
    "상처": ["#상처", "#아픔"],
    "당황": ["#당황", "#혼란"],
    "기쁨": ["#기쁨", "#행복", "#즐거움"]
}

custom_combinations = {
    ("불안", "슬픔", "걱정스러운"): ["#감정혼란", "#불편한하루"],
    ("불안", "걱정스러운", "슬픔"): ["#긴장과우울", "#복잡한마음"],
    ("슬픔", "불안", "우울한"): ["#마음의구름", "#침체된기분"],
    ("기쁨", "신이 난", "만족스러운"): ["#완벽한하루", "#행복충전"],
    ("기쁨", "감사하는", "편안한"): ["#소확행", "#잔잔한행복"],
    ("분노", "짜증내는", "성가신"): ["#화가난하루", "#짜증폭발"],
    ("분노", "억울한", "괴로워하는"): ["#억울함", "#감정폭발"],
    ("당황", "혼란스러운", "초조한"): ["#혼란의연속", "#불확실한기분"],
    ("상처", "배신당한", "외로운"): ["#외로움", "#신뢰붕괴"],
    ("불안", "초조한", "두려운"): ["#불안감", "#긴장된하루"],
    ("우울한", "눈물이 나는", "실망한"): ["#우울모드", "#마음이무거워"],
    ("자신하는", "신뢰하는", "기쁨"): ["#자신감업", "#믿음과희망"],
        ("성가신", "짜증내는", "툴툴대는"): ["#짜증주의보", "#불쾌지수상승"],
    ("감사하는", "기쁨", "편안한"): ["#따뜻한마음", "#행복의순간"],
    ("실망한", "우울한", "분노"): ["#감정기복", "#실망과분노"],
    ("눈물이 나는", "비통한", "낙담한"): ["#마음의폭우", "#슬픔이가득"],
    ("두려운", "스트레스 받는", "불안"): ["#불안장벽", "#긴장상태"],
    ("편안한", "느긋", "안도"): ["#휴식의시간", "#마음의여유"],
    ("가난한 불우한", "희생된", "억울한"): ["#부당한현실", "#불공정"],
    ("질투하는", "배신당한", "열등감"): ["#질투심폭발", "#자존감회복필요"]
}

# 512 토큰 이내에서 문장 청크, 그 후 다음 분석을 진행할 때 이전 문장을 포함하여 분석.
def split_with_overlap(sentences, tokenizer, max_tokens=512, overlap=1):
    batches = []
    start_idx = 0
    while start_idx < len(sentences):
        current_len = 0
        end_idx = start_idx
        # 토큰 누적 계산
        while end_idx < len(sentences):
            sent_len = len(tokenizer.tokenize(sentences[end_idx]))
            if current_len + sent_len > max_tokens:
                break
            current_len += sent_len
            end_idx += 1

        # end_idx 기준 청크 모으기
        chunk = sentences[start_idx:end_idx]
        batches.append(" ".join(chunk))

        # 다음 청크 시작점: end_idx - overlap (중복 문장 포함)
        start_idx = max(end_idx - overlap, 0)
        if end_idx == len(sentences):
            break

    return batches